XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/bl606p.h
#if defined(CPU_D0)
    /******  BL606P specific Interrupt Numbers **********************************************************************/
    BMX_DSP_BUS_ERR_IRQn = IRQ_NUM_BASE + 0,  /*!< BMX DSP BUS Error Interrupt                                       */
    RESERVED0_IRQn = IRQ_NUM_BASE + 1,        /*!< Reserved Interrupt                                                */
    D0_RESERVED2_IRQn = IRQ_NUM_BASE + 2,     /*!< IPC reserved Interrupt                                            */
    UART3_IRQn = IRQ_NUM_BASE + 4,            /*!< UART3 Interrupt                                                   */
    I2C2_IRQn = IRQ_NUM_BASE + 5,             /*!< I2C2 Interrupt                                                    */
    I2C3_IRQn = IRQ_NUM_BASE + 6,             /*!< I2C3 Interrupt                                                    */
    SPI1_IRQn = IRQ_NUM_BASE + 7,             /*!< SPI1 Interrupt                                                    */
    RESERVED1_IRQn = IRQ_NUM_BASE + 8,        /*!< Reserved Interrupt                                                */
    RESERVED2_IRQn = IRQ_NUM_BASE + 9,        /*!< Reserved Interrupt                                                */
    RESERVED3_IRQn = IRQ_NUM_BASE + 10,       /*!< Reserved Interrupt                                                */
    RESERVED4_IRQn = IRQ_NUM_BASE + 11,       /*!< Reserved Interrupt                                                */
    RESERVED5_IRQn = IRQ_NUM_BASE + 12,       /*!< Reserved Interrupt                                                */
    RESERVED6_IRQn = IRQ_NUM_BASE + 13,       /*!< Reserved Interrupt                                                */
    RESERVED7_IRQn = IRQ_NUM_BASE + 14,       /*!< Reserved Interrupt                                                */
    RESERVED8_IRQn = IRQ_NUM_BASE + 15,       /*!< Reserved Interrupt                                                */
    RESERVED9_IRQn = IRQ_NUM_BASE + 16,       /*!< Reserved Interrupt                                                */
    RESERVED10_IRQn = IRQ_NUM_BASE + 17,      /*!< Reserved Interrupt                                                */
    RESERVED11_IRQn = IRQ_NUM_BASE + 18,      /*!< Reserved Interrupt                                                */
    RESERVED12_IRQn = IRQ_NUM_BASE + 19,      /*!< Reserved Interrupt                                                */
    RESERVED13_IRQn = IRQ_NUM_BASE + 20,      /*!< Reserved Interrupt                                                */
    RESERVED14_IRQn = IRQ_NUM_BASE + 21,      /*!< Reserved Interrupt                                                */
    RESERVED15_IRQn = IRQ_NUM_BASE + 22,      /*!< Reserved Interrupt                                                */
    RESERVED16_IRQn = IRQ_NUM_BASE + 23,      /*!< Reserved Interrupt                                                */
    DMA2_INT0_IRQn = IRQ_NUM_BASE + 24,       /*!< DMA2 INT0 Interrupt                                               */
    DMA2_INT1_IRQn = IRQ_NUM_BASE + 25,       /*!< DMA2 INT1 Interrupt                                               */
    DMA2_INT2_IRQn = IRQ_NUM_BASE + 26,       /*!< DMA2 INT2 Interrupt                                               */
    DMA2_INT3_IRQn = IRQ_NUM_BASE + 27,       /*!< DMA2 INT3 Interrupt                                               */
    DMA2_INT4_IRQn = IRQ_NUM_BASE + 28,       /*!< DMA2 INT4 Interrupt                                               */
    DMA2_INT5_IRQn = IRQ_NUM_BASE + 29,       /*!< DMA2 INT5 Interrupt                                               */
    DMA2_INT6_IRQn = IRQ_NUM_BASE + 30,       /*!< DMA2 INT6 Interrupt                                               */
    DMA2_INT7_IRQn = IRQ_NUM_BASE + 31,       /*!< DMA2 INT7 Interrupt                                               */
    SDH_MMC1_IRQn = IRQ_NUM_BASE + 32,        /*!< SDH MMC1 Interrupt                                                */
    SDH_MMC3_IRQn = IRQ_NUM_BASE + 33,        /*!< SDH MMC3 Interrupt                                                */
    SDH2PMU_WAKEUP1_IRQn = IRQ_NUM_BASE + 34, /*!< SDH2PMU Wakeup1 Interrupt                                         */
    SDH2PMU_WAKEUP3_IRQn = IRQ_NUM_BASE + 35, /*!< SDH2PMU Wakeup3 Interrupt                                         */
    EMAC2_IRQn = IRQ_NUM_BASE + 36,           /*!< EMAC2 Interrupt                                                   */
    RESERVED17_IRQn = IRQ_NUM_BASE + 37,      /*!< Reserved Interrupt                                                */
    IPC_D0_IRQn = IRQ_NUM_BASE + 38,          /*!< IPC D0 Interrupt                                                  */
    APU_IRQn = IRQ_NUM_BASE + 39,             /*!< APU Interrupt                                                     */
    RESERVED18_IRQn = IRQ_NUM_BASE + 40,      /*!< Reserved Interrupt                                                */
    RESERVED19_IRQn = IRQ_NUM_BASE + 41,      /*!< Reserved Interrupt                                                */
    RESERVED20_IRQn = IRQ_NUM_BASE + 42,      /*!< Reserved Interrupt                                                */
    RESERVED21_IRQn = IRQ_NUM_BASE + 43,      /*!< Reserved Interrupt                                                */
    RESERVED22_IRQn = IRQ_NUM_BASE + 44,      /*!< Reserved Interrupt                                                */
    RESERVED23_IRQn = IRQ_NUM_BASE + 45,      /*!< Reserved Interrupt                                                */
    RESERVED24_IRQn = IRQ_NUM_BASE + 46,      /*!< Reserved Interrupt                                                */
    RESERVED25_IRQn = IRQ_NUM_BASE + 47,      /*!< Reserved Interrupt                                                */
    PWM_IRQn = IRQ_NUM_BASE + 48,             /*!< PWM1 Interrupt                                                    */
    RESERVED26_IRQn = IRQ_NUM_BASE + 49,      /*!< Reserved Interrupt                                                */
    RESERVED27_IRQn = IRQ_NUM_BASE + 50,      /*!< Reserved Interrupt                                                */
    RESERVED28_IRQn = IRQ_NUM_BASE + 51,      /*!< Reserved Interrupt                                                */
    RESERVED29_IRQn = IRQ_NUM_BASE + 52,      /*!< Reserved Interrupt                                                */
    RESERVED30_IRQn = IRQ_NUM_BASE + 53,      /*!< Reserved Interrupt                                                */
    RESERVED31_IRQn = IRQ_NUM_BASE + 54,      /*!< Reserved Interrupt                                                */
    RESERVED32_IRQn = IRQ_NUM_BASE + 55,      /*!< Reserved Interrupt                                                */
    RESERVED33_IRQn = IRQ_NUM_BASE + 56,      /*!< Reserved Interrupt                                                */
    RESERVED34_IRQn = IRQ_NUM_BASE + 57,      /*!< Reserved Interrupt                                                */
    RESERVED35_IRQn = IRQ_NUM_BASE + 58,      /*!< Reserved Interrupt                                                */
    RESERVED36_IRQn = IRQ_NUM_BASE + 59,      /*!< Reserved Interrupt                                                */
    RESERVED37_IRQn = IRQ_NUM_BASE + 60,      /*!< Reserved Interrupt                                                */
    TIMER1_CH0_IRQn = IRQ_NUM_BASE + 61,      /*!< Timer1 Channel 0 Interrupt                                        */
    TIMER1_CH1_IRQn = IRQ_NUM_BASE + 62,      /*!< Timer1 Channel 1 Interrupt                                        */
    TIMER1_WDT_IRQn = IRQ_NUM_BASE + 63,      /*!< Timer1 Watch Dog Interrupt                                        */
    AUDIO_IRQn = IRQ_NUM_BASE + 64,           /*!< Audio Interrupt                                                   */
    WL_ALL_IRQn = IRQ_NUM_BASE + 65,          /*!< WL System All Interrupt                                           */
    PDS_IRQn = IRQ_NUM_BASE + 66,             /*!< PDS Interrupt                                                     */
    IRQn_LAST,
#endif
} IRQn_Type;

/* Add following macro definition in order to pass the compilation */
#if defined(CPU_M0) || defined(CPU_LP)
#define BMX_DSP_BUS_ERR_IRQn (IRQn_LAST)
#define D0_RESERVED2_IRQn    (IRQn_LAST)
#define UART3_IRQn           (IRQn_LAST)
#define I2C2_IRQn            (IRQn_LAST)
#define I2C3_IRQn            (IRQn_LAST)
#define SPI1_IRQn            (IRQn_LAST)
#define DMA2_INT0_IRQn       (IRQn_LAST)
#define DMA2_INT1_IRQn       (IRQn_LAST)
#define DMA2_INT2_IRQn       (IRQn_LAST)
#define DMA2_INT3_IRQn       (IRQn_LAST)
#define DMA2_INT4_IRQn       (IRQn_LAST)
#define DMA2_INT5_IRQn       (IRQn_LAST)
#define DMA2_INT6_IRQn       (IRQn_LAST)
#define DMA2_INT7_IRQn       (IRQn_LAST)
#define SDH_MMC1_IRQn        (IRQn_LAST)
#define SDH_MMC3_IRQn        (IRQn_LAST)
#define SDH2PMU_WAKEUP1_IRQn (IRQn_LAST)
#define SDH2PMU_WAKEUP3_IRQn (IRQn_LAST)
#define EMAC2_IRQn           (IRQn_LAST)
#define IPC_D0_IRQn          (IRQn_LAST)
#define APU_IRQn             (IRQn_LAST)
#define TIMER1_CH0_IRQn      (IRQn_LAST)
#define TIMER1_CH1_IRQn      (IRQn_LAST)
#define TIMER1_WDT_IRQn      (IRQn_LAST)
#define WL_ALL_IRQn          (IRQn_LAST)
#define PDS_IRQn             (IRQn_LAST)
#endif

