XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/bl606p.h
#if defined(CPU_D0)
#define BMX_MCU_BUS_ERR_IRQn                   (IRQn_LAST)
#define BMX_MCU_TO_IRQn                        (IRQn_LAST)
#define M0_RESERVED2_IRQn                      (IRQn_LAST)
#define IPC_M0_IRQn                            (IRQn_LAST)
#define RF_TOP_INT0_IRQn                       (IRQn_LAST)
#define RF_TOP_INT1_IRQn                       (IRQn_LAST)
#define LZ4D_IRQn                              (IRQn_LAST)
#define GAUGE_ITF_IRQn                         (IRQn_LAST)
#define SEC_ENG_ID1_SHA_AES_TRNG_PKA_GMAC_IRQn (IRQn_LAST)
#define SEC_ENG_ID0_SHA_AES_TRNG_PKA_GMAC_IRQn (IRQn_LAST)
#define SEC_ENG_ID1_CDET_IRQn                  (IRQn_LAST)
#define SEC_ENG_ID0_CDET_IRQn                  (IRQn_LAST)
#define SF_CTRL_ID1_IRQn                       (IRQn_LAST)
#define SF_CTRL_ID0_IRQn                       (IRQn_LAST)
#define DMA0_ALL_IRQn                          (IRQn_LAST)
#define DMA1_ALL_IRQn                          (IRQn_LAST)
#define SDH_IRQn                               (IRQn_LAST)
#define MM_ALL_IRQn                            (IRQn_LAST)
#define IRTX_IRQn                              (IRQn_LAST)
#define IRRX_IRQn                              (IRQn_LAST)
#define USB_IRQn                               (IRQn_LAST)
#define AUPDM_IRQn                             (IRQn_LAST)
#define M0_RESERVED23_IRQn                     (IRQn_LAST)
#define EMAC_IRQn                              (IRQn_LAST)
#define GPADC_DMA_IRQn                         (IRQn_LAST)
#define EFUSE_IRQn                             (IRQn_LAST)
#define SPI0_IRQn                              (IRQn_LAST)
#define UART0_IRQn                             (IRQn_LAST)
#define UART1_IRQn                             (IRQn_LAST)
#define UART2_IRQn                             (IRQn_LAST)
#define GPIO_DMA_IRQn                          (IRQn_LAST)
#define I2C0_IRQn                              (IRQn_LAST)
#define IPC_RSVD_IRQn                          (IRQn_LAST)
#define IPC_LP_IRQn                            (IRQn_LAST)
#define TIMER0_CH0_IRQn                        (IRQn_LAST)
#define TIMER0_CH1_IRQn                        (IRQn_LAST)
#define TIMER0_WDT_IRQn                        (IRQn_LAST)
#define I2C1_IRQn                              (IRQn_LAST)
#define I2S_IRQn                               (IRQn_LAST)
#define ANA_OCP_OUT_TO_CPU_0_IRQn              (IRQn_LAST)
#define ANA_OCP_OUT_TO_CPU_1_IRQn              (IRQn_LAST)
#define ANA_OCP_OUT_TO_CPU_2_IRQn              (IRQn_LAST)
#define GPIO_INT0_IRQn                         (IRQn_LAST)
#define DM_IRQn                                (IRQn_LAST)
#define BT_IRQn                                (IRQn_LAST)
#define M154_REQ_ACK_IRQn                      (IRQn_LAST)
#define M154_INT_IRQn                          (IRQn_LAST)
#define M154_AES_IRQn                          (IRQn_LAST)
#define PDS_WAKEUP_IRQn                        (IRQn_LAST)
#define HBN_OUT0_IRQn                          (IRQn_LAST)
#define HBN_OUT1_IRQn                          (IRQn_LAST)
#define BOR_IRQn                               (IRQn_LAST)
#define WIFI_IRQn                              (IRQn_LAST)
#define BZ_PHY_INT_IRQn                        (IRQn_LAST)
#define BLE_IRQn                               (IRQn_LAST)
#define MAC_TXRX_TIMER_IRQn                    (IRQn_LAST)
#define MAC_TXRX_MISC_IRQn                     (IRQn_LAST)
#define MAC_RX_TRG_IRQn                        (IRQn_LAST)
#define MAC_TX_TRG_IRQn                        (IRQn_LAST)
#define MAC_GEN_IRQn                           (IRQn_LAST)
#define MAC_PORT_TRG_IRQn                      (IRQn_LAST)
#define WIFI_IPC_PUBLIC_IRQn                   (IRQn_LAST)
#endif

/**
 * @brief BL606P Memory Map Definitions
 */
#define BL606P_OCRAM_BASE                   (0x22020000)
#define BL606P_OCRAM_END                    (0x22020000 + 64 * 1024)
#define BL606P_OCRAM_CACHEABLE_BASE         (0x62020000)
#define BL606P_OCRAM_CACHEABLE_END          (0x62020000 + 64 * 1024)

#define BL606P_WRAM_BASE                    (0x22030000)
#define BL606P_WRAM_END                     (0x22030000 + 160 * 1024)
#define BL606P_WRAM_CACHEABLE_BASE          (0x62030000)
#define BL606P_WRAM_CACHEABLE_END           (0x62030000 + 160 * 1024)

#define BL606P_MCU_ALLRAM_BASE              (0x22020000)
#define BL606P_MCU_ALLRAM_END               (0x22020000 + 64 * 1024 + 160 * 1024)
#define BL606P_MCU_ALLRAM_CACHEABLE_BASE    (0x62020000)
#define BL606P_MCU_ALLRAM_CACHEABLE_END     (0x62020000 + 64 * 1024 + 160 * 1024)

#define BL606P_DRAM_BASE                    (0x3EF80000)
#define BL606P_DRAM_END                     (0x3EF80000 + 512 * 1024)
#define BL606P_DRAM_CACHEABLE_BASE          (0x7EF80000)
#define BL606P_DRAM_CACHEABLE_END           (0x7EF80000 + 512 * 1024)

#define BL606P_VRAM_BASE                    (0x3F000000)
#define BL606P_VRAM_END                     (0x3F000000 + 32 * 1024)
#define BL606P_VRAM_CACHEABLE_BASE          (0x7F000000)
#define BL606P_VRAM_CACHEABLE_END           (0x7F000000 + 32 * 1024)

#define BL606P_DSP_ALLRAM_BASE              (0x3EF80000)
#define BL606P_DSP_ALLRAM_END               (0x3EF80000 + 512 * 1024 + 32 * 1024)
#define BL606P_DSP_ALLRAM_CACHEABLE_BASE    (0x7EF80000)
#define BL606P_DSP_ALLRAM_CACHEABLE_END     (0x7EF80000 + 512 * 1024 + 32 * 1024)

#define BL606P_FLASH_XIP_BASE               (0x58000000)
#define BL606P_FLASH_XIP_END                (0x58000000 + 64 * 1024 * 1024)
#define BL606P_FLASH2_XIP_BASE              (0x5C000000)
#define BL606P_FLASH2_XIP_END               (0x5C000000 + 64 * 1024 * 1024)
#define BL606P_FLASH_XIP_REMAP0_BASE        (0xD8000000)
#define BL606P_FLASH_XIP_REMAP0_END         (0xD8000000 + 64 * 1024 * 1024)
#define BL606P_FLASH2_XIP_REMAP0_BASE       (0xDC000000)
#define BL606P_FLASH2_XIP_REMAP0_END        (0xDC000000 + 64 * 1024 * 1024)

#define BL606P_DSP_WHOLERAM_BASE                (0x3EF80000)
#define BL606P_DSP_WHOLERAM_END                 (0x3EF80000 + 512 * 1024 + 96 * 1024)
#define BL606P_DSP_WHOLERAM_CACHEABLE_BASE      (0x7EF80000)
#define BL606P_DSP_WHOLERAM_CACHEABLE_END       (0x7EF80000 + 512 * 1024 + 96 * 1024)

/*@} end of group Memory_Map_Section */

/* BL606P peripherals base address */
/* WLSYS */
#define GLB_BASE         ((uint32_t)0x20000000)
#define MIX_BASE         ((uint32_t)0x20001000)
#define GPIP_BASE        ((uint32_t)0x20002000)
#define PHY_BASE         ((uint32_t)0x20002800)
#define AGC_BASE         ((uint32_t)0x20002c00)
#define SEC_DBG_BASE     ((uint32_t)0x20003000)
#define SEC_ENG_BASE     ((uint32_t)0x20004000)
#define TZ1_BASE         ((uint32_t)0x20005000)
#define TZC_SEC_BASE     ((uint32_t)0x20005000)
#define TZ2_BASE         ((uint32_t)0x20006000)
#define TZC_NSEC_BASE    ((uint32_t)0x20006000)
#define EFUSE_BASE       ((uint32_t)0x20056000)
#define EF_DATA_BASE     ((uint32_t)0x20056000)
#define EF_CTRL_BASE     ((uint32_t)0x20056000)
#define CCI_BASE         ((uint32_t)0x20008000)
#define MCU_MISC_BASE    ((uint32_t)0x20009000)
#define L1C_BASE         ((uint32_t)0x20009000)
#define UART0_BASE       ((uint32_t)0x2000a000)
#define UART1_BASE       ((uint32_t)0x2000a100)
#define SPI0_BASE        ((uint32_t)0x2000a200)
#define I2C0_BASE        ((uint32_t)0x2000a300)
#define PWM_BASE         ((uint32_t)0x2000a400)
#define TIMER0_BASE      ((uint32_t)0x2000a500)
#define IR_BASE          ((uint32_t)0x2000a600)
#define CKS_BASE         ((uint32_t)0x2000a700)
#define IPC0_BASE        ((uint32_t)0x2000a800)
#define IPC1_BASE        ((uint32_t)0x2000a840)
#define I2C1_BASE        ((uint32_t)0x2000a900)
#define UART2_BASE       ((uint32_t)0x2000aa00)
#define ISO11898_BASE    ((uint32_t)0x2000aa00)
#define I2S_BASE         ((uint32_t)0x2000ab00)
#define PDM0_BASE        ((uint32_t)0x2000a000)
#define LZ4D_BASE        ((uint32_t)0x2000ad00)
#define QSPI_BASE        ((uint32_t)0x2000b000)
#define SF_CTRL_BASE     ((uint32_t)0x2000b000)
#define SF_CTRL_BUF_BASE ((uint32_t)0x2000b600)
#define DMA0_BASE        ((uint32_t)0x2000c000)
#define PDS_BASE         ((uint32_t)0x2000e000)
#define HBN_BASE         ((uint32_t)0x2000f000)
#define AON_BASE         ((uint32_t)0x2000f000)
#define EMI_MISC_BASE    ((uint32_t)0x20050000)
#define PSRAM_CTRL_BASE  ((uint32_t)0x20052000)
#define USB_BASE         ((uint32_t)0x20072000)
#define AUDIO_BASE       ((uint32_t)0x20055000)
#define SDH_BASE         ((uint32_t)0x20060000)
#define EMAC_BASE        ((uint32_t)0x20070000)
#define DMA1_BASE        ((uint32_t)0x20071000)

